{
  "id": "LazyCowboy.ParallaxEffect",
  "name": "Parallax Effect",
  "version": "0.0.1",
  "target_game_version": "v1.10",
  "authors": "LazyCowboy",
  "description": "Implements a basic parallax-like effect using a shader, making the world look a lot more 3-dimensional. Additionally, it can be used to make rooms appear slightly higher resolution (experimental setting).<LINE><LINE>Compatible with SBCameraScroll! Although intended for the vanilla camera, this mod works in conjunction with SBCameraScroll; so now you can have both smooth scrolling and depth perception!<LINE>Also compatible with Sharpener, but it is recommended to not use this mod's experimental Resolution Scale feature in conjunction with Sharpener.<LINE><LINE>Offers a lot of configuration options in the mod's remix config menu. The very first option directly scales the intensity of the parallax effect. The other options... Good luck!<LINE><LINE>Slight frame drops guaranteed (although there is some option for \"optimization\"). If you are experiencing much lag, try reducing the Warp Factor, decreasing the Max Warp, increasing Optimization, setting Minimum Warp to 0.00, and disabling Resolution Scale, and definitely do not use the \"Don't Extend Objects\" option.<LINE><LINE>I have longed desired a parallax shader, so here's some Special Thanks:<LINE> - Gamer025 for helping me to implement my first shader<LINE> - SchuhBaum for designing SBCameraScroll well<LINE> - The dev(s) who put the shader source code in StreamingAssets<LINE> - The dev(s) who designed LevelTexCombiner, making this easier (btw, should I require Watcher for this mod??)<LINE> - The original Videocult folks for making such beautiful, underappreciated, 3D environments<LINE> - My God for bearing with my folly and granting me the strength to accomplish this. Without His help I would not have accomplished anything at all.",
  "requirements": [],
  "requirements_names": [],
  "tags": ["Cosmetics", "Base", "Downpour", "Watcher"],
  "checksum_override_version": false
}